<h4>Campus Campina Grande</h4>
<h4>Curso: Engenharia de Computação</h4>
<h4>Disciplina: Estatística aplicada a computação</h4>
<h4>Professor: Paulo Ribeiro Lins Júnior</h4>
<h4>Aluno: Flávia Renata Vieira do Nascimento</h4>
<hr>
<center><h1 style="color:Blue;">Lista de Exercicio da Semana 4</h1></center> 
<hr>
<br>

<h3 style="color:Blue;"><center>1.Considere as tabelas de vendas diárias de três lojas:</center></h3>

In [1]:
import numpy as np
import pandas as pd

print("--------------- TABELA A --------------------")

lojaA = pd.DataFrame({"loja":["A", "A", "A"],
                          "dia": ["sex", "sab", "dom"],
                         "valor":[7500, 9500, 8200]}

                        )
lojaA

--------------- TABELA A --------------------

  loja  dia  valor
0    A  sex   7500
1    A  sab   9500
2    A  dom   8200

In [27]:

print("\n--------------- TABELA B --------------------\n")

lojaB = pd.DataFrame({"loja":["B", "B", "B"],
                      "dia": ["sex", "sab", "dom"],
                      "valor":[5100, 8250, 9900]}

                        )

lojaB

--------------- TABELA B --------------------

  loja  dia  valor
0    B  sex   5100
1    B  sab   8250
2    B  dom   9900

In [31]:

print("\n--------------- TABELA C --------------------\n")

lojaC = pd.DataFrame({"loja":["C", "C"],
                 "dia": ["sab", "dom"],
                 "valor":[7500, 11800]}

                 )

lojaC

--------------- TABELA C --------------------

  loja  dia  valor
0    C  sab   7500
1    C  dom  11800

In [32]:
loja3 = pd.concat([lojaA,lojaB,lojaC],ignore_index=True)


loja3

  loja  dia  valor
0    A  sex   7500
1    A  sab   9500
2    A  dom   8200
3    B  sex   5100
4    B  sab   8250
5    B  dom   9900
6    C  sab   7500
7    C  dom  11800

<h3 style="color:Blue;"><center>2. Com base nos dataframes a seguir, que guardam informações de matriculas de
alunos em dois cursos, um de SQL e outro de Python:</center></h3>

In [6]:
                    # A - Quais são os alunos distintos, considerando ambas as listas?
    
SQL = pd.DataFrame({"email":["rakesh@xyz.com","ecg@acmecorpus.com"]})

PYTHON = pd.DataFrame({"email":["ana@xyz.com", "jonas@acmecorpus.com","rakesh@xyz.com"]})


print("\n---------------ALUNOS DISTINTOS--------------------")
    
alunoS = pd.concat([SQL,PYTHON],ignore_index=True)    

alunoSdistintos = alunoS.drop_duplicates()

alunoSdistintos

---------------ALUNOS DISTINTOS--------------------

                  email
0        rakesh@xyz.com
1    ecg@acmecorpus.com
2           ana@xyz.com
3  jonas@acmecorpus.com

In [13]:
                        # B - Quais são os alunos que fizeram ambos os cursos?
    
SQL = pd.DataFrame({"email":["rakesh@xyz.com","ecg@acmecorpus.com"]})

PYTHON = pd.DataFrame({"email":["ana@xyz.com", "jonas@acmecorpus.com","rakesh@xyz.com"]})
   
print("\n---------------ALUNOS QUE CURSAM PYTHON E SQL--------------------")    

SQL.merge(PYTHON)

---------------ALUNOS QUE CURSAM PYTHON E SQL--------------------

            email
0  rakesh@xyz.com

In [19]:
                    # C -  Quais os alunos que realizaram o curso de PYTHON, mas não o de SQL?


SQL = pd.DataFrame({"email":["rakesh@xyz.com","ecg@acmecorpus.com"]})

PYTHON = pd.DataFrame({"email":["ana@xyz.com", "jonas@acmecorpus.com","rakesh@xyz.com"]})

   
print("\n---------------ALUNOS QUE CURSAM PYTHON--------------------")   

python = PYTHON[PYTHON.email.isin(SQL.email)== False]

python

---------------ALUNOS QUE CURSAM PYTHON--------------------

                  email
0           ana@xyz.com
1  jonas@acmecorpus.com

In [20]:
                    # C -  Quais os alunos que realizaram o curso de SQL, mas não o de PYTHON?

print("\n---------------ALUNOS QUE CURSAM SQL--------------------")   

sql = SQL[SQL.email.isin(PYTHON.email)== False]

sql

---------------ALUNOS QUE CURSAM SQL--------------------

                email
1  ecg@acmecorpus.com

<h3 style="color:Blue;"><center>3. Considere os dois dataframes a seguir, referentes aos dados sobre os departamentos e os funcionários de uma empresa.</center></h3>

In [37]:
dic_emp = {"id":["D1","D2","D3","D4"],
           "nomDepto": ["Compras","RH","TI","Vendas"],
           "local":["SP","RJ","RJ","SP"]}


dic_func = {"num":[3199,3269,3555,3788,3844],
            "nome": ["Ana","David","José","Marina","Luís"],
            "salario":[1600,2975,1500,5000,3000],
            "idDepto": ["D2","D3",None,"D2","D4"]}

            
lista_funcionarios = pd.DataFrame(dic_func)
dados_empresa = pd.DataFrame(dic_emp)

empresa = pd.merge(lista_funcionarios,dados_empresa, left_on = "idDepto",right_on = "id")


empresa

    num    nome  salario idDepto  id nomDepto local
0  3199     Ana     1600      D2  D2       RH    RJ
1  3788  Marina     5000      D2  D2       RH    RJ
2  3269   David     2975      D3  D3       TI    RJ
3  3844    Luís     3000      D4  D4   Vendas    SP